tutorials/cfdemSolverPisoScalar/packedBedTemp/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

modelType B; // A or B

couplingInterval 200;

voidFractionModel divided;

locateModel engine;

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel off;

dataExchangeModel twoWayMPI;//twoWayFiles;//oneWayVTK;//

averagingModel dilute;//dense;//

clockModel off;

forceModels
(
    KochHillDrag
    LaEuScalarTemp
    Archimedes
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType RASProperties;//LESProperties;//

//===========================================================================//
// sub-model properties

LaEuScalarTempProps
{
    velFieldName "U";
    tempFieldName "T";
    voidfractionFieldName "voidfraction";
    tempSourceFieldName "Tsource";
    partTempName "Temp";
    partHeatFluxName "convectiveHeatFlux";
    lambda 0.0256;
    Cp 1007;
    densityFieldName "rho";
}

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
    //KslLimit 0;  // source switched off!!!
}

KochHillDragProps
{
    velFieldName "U";
    densityFieldName "rho";
    voidfractionFieldName "voidfraction";
}

DiFeliceDragProps
{
    velFieldName "U";
    densityFieldName "rho";
    //verbose;
}

ArchimedesProps
{
    densityFieldName "rho";
    gravityFieldName "g";
}
gradPForceProps
{
    pFieldName "p";
    densityFieldName "rho";
    interpolation;
}

viscForceProps
{
    velocityFieldName "U";
    densityFieldName "rho";
    interpolation;
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayMPIProps
{
    maxNumberOfParticles 10000;
    liggghtsPath "../DEM/in.liggghts_init";
}

centreProps
{
    alphaMin 0.1;
}

dividedProps
{
    alphaMin 0.1;
    scaleUpVol 1.0;
}

engineProps
{
    treeSearch true;
}

// ************************************************************************* //
